In [65]:
import pandas as p
import numpy as n 
import matplotlib.pyplot as plot
from word2number import w2n
from sklearn import linear_model

In [121]:
df = p.read_csv(r'G:\Machine Learning\jupyter csv files\LRMV_testCase.csv') #to upload a file from differentlocation use r before quotes

In [122]:
df

  Duration  Test_Score  Interview_Score  Price
0      NaN         8.0                9  50000
1      NaN         8.0                6  45000
2     five         6.0                7  60000
3      two        10.0               10  65000
4    seven         9.0                6  70000
5    three         7.0               10  62000
6      ten         NaN                7  72000
7   eleven         7.0                8  80000

In [123]:
pip install word2number

Requirement already satisfied: word2number in c:\users\welcome\anaconda3\lib\site-packages (1.1)
Note: you may need to restart the kernel to use updated packages.

In [124]:
df.Test_Score = df.Test_Score.fillna(df.Test_Score.median())
df

  Duration  Test_Score  Interview_Score  Price
0      NaN         8.0                9  50000
1      NaN         8.0                6  45000
2     five         6.0                7  60000
3      two        10.0               10  65000
4    seven         9.0                6  70000
5    three         7.0               10  62000
6      ten         8.0                7  72000
7   eleven         7.0                8  80000

In [125]:
df['Duration'] = df['Duration'].fillna('zero') #fill  the na part in duration with zero 
df

  Duration  Test_Score  Interview_Score  Price
0     zero         8.0                9  50000
1     zero         8.0                6  45000
2     five         6.0                7  60000
3      two        10.0               10  65000
4    seven         9.0                6  70000
5    three         7.0               10  62000
6      ten         8.0                7  72000
7   eleven         7.0                8  80000

In [126]:
df.Duration = df.Duration.apply(w2n.word_to_num) #convert words to number in duration

In [127]:
df

   Duration  Test_Score  Interview_Score  Price
0         0         8.0                9  50000
1         0         8.0                6  45000
2         5         6.0                7  60000
3         2        10.0               10  65000
4         7         9.0                6  70000
5         3         7.0               10  62000
6        10         8.0                7  72000
7        11         7.0                8  80000

In [128]:
lr =linear_model.LinearRegression()

In [130]:
lr.fit(df[['Duration','Test_Score','Interview_Score']],df.Price)

LinearRegression()

In [131]:
lr.predict([[2,9,6]])

array([53205.96797671])

In [132]:
lr.coef_

array([2812.95487627, 1845.70596798, 2205.24017467])

In [133]:
lr.intercept_

17737.26346433771